import { Term } from './types';

export const CURRICULUM: Term[] = [
  {
    termTitle: 'المنهج الدراسي 2025/2026',
    units: [
      {
        title: 'الوحدة الأولى: المادة',
        lessons: [
          { title: 'درس: المادة وخصائصها' },
          { title: 'درس: تركيب الذرة' },
          { title: 'درس: الجدول الدوري لتصنيف العناصر' },
          { title: 'درس: الروابط الكيميائية' },
        ],
      },
      {
        title: 'الوحدة الثانية: مجالات القوى',
        lessons: [
          { title: 'درس: القوى الكهربية' },
          { title: 'درس: القوى المغناطيسية' },
          { title: 'درس: قوى الجاذبية' },
        ],
      },
      {
        title: 'الوحدة الثالثة: الكائنات الحية - تركيبها وعملياتها',
        lessons: [
          { title: 'درس: الخلايا والحياة' },
          { title: 'درس: الصفات العامة للكائنات الحية' },
          { title: 'درس: الميكروبات' },
        ],
      },
      {
        title: 'الوحدة الرابعة: نظام (الأرض-الشمس-القمر)',
        lessons: [
          { title: 'درس: الأرض والنظام الشمسي' },
          { title: 'درس: خسوف القمر' },
        ],
      },
    ]
  }
];
